
&НаСервере
Процедура ВидОперацииПриИзмененииНаСервере()
	
	Если Объект.ВидОперации = Перечисления.ВидыОперацийНакладной.Расход Тогда
		
		Объект.ТипЦен = Справочники.ТипыЦен.НайтиПоНаименованию("Продажная");
		
	Иначе
		
		Объект.ТипЦен = Справочники.ТипыЦен.НайтиПоНаименованию("Закупочная");
		
	КонецЕсли;
	
	ПересчетТЧ();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОперацииПриИзменении(Элемент)
	ВидОперацииПриИзмененииНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЦенуИКоэффициент(Номенклатура, ТипЦен)
	
	ВозвратСтруктура = Новый Структура("Цена, Коэффициент", 0, 0);
	
	ВозвратСтруктура.Вставить("Коэффициент", Номенклатура.Коэффициент);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныНоменклатурыСрезПоследних.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(
	|			,
	|			Номенклатура = &Номенклатура
	|				И ТипЦен = &ТипЦен) КАК ЦеныНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		ВозвратСтруктура.Вставить("Цена", ВыборкаДетальныеЗаписи.Цена);
		
	КонецЕсли;
	
	Возврат ВозвратСтруктура;
	
КонецФункции

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	Данные = ПолучитьЦенуИКоэффициент(ТекущаяСтрока.Номенклатура, Объект.ТипЦен);
	ТекущаяСтрока.Коэффициент = Данные.Коэффициент;
	ТекущаяСтрока.Цена = Данные.Цена;
	Если ТекущаяСтрока.Количество = 0 Тогда
		
		ТекущаяСтрока.Сумма = 0;
		
	Иначе
		
		ПересчетСуммы(ТекущаяСтрока);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ПересчетСуммы(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыКоэффициентПриИзменении(Элемент)
	
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	ПересчетСуммы(ТекущаяСтрока);
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчетСуммы(Строка)
	
	Строка.Сумма = Строка.Количество * Строка.Цена * Строка.Коэффициент;
	
КонецПроцедуры

&НаСервере
Процедура ПересчетТЧ()
	
	Для Каждого СтрокаТЧ ИЗ Объект.Товары Цикл 
		
		Данные = ПолучитьЦенуИКоэффициент(СтрокаТЧ.Номенклатура, Объект.ТипЦен);
		
		СтрокаТЧ.Коэффициент = Данные.Коэффициент;
		СтрокаТЧ.Цена 		  = Данные.Цена;
		
		СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена * СтрокаТЧ.Коэффициент;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЦенПриИзменении(Элемент)
	ПересчетТЧ();
КонецПроцедуры
