
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьДокумента)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьДокумента(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьДокумента(ТабДок, ПараметрКоманды)
	Документы.Накладные.ПечатьДокумента(ТабДок, ПараметрКоманды);
КонецПроцедуры
